/*страна(Страна, Столица, Население, Материк)*/

страна("Россия", "Москва", 143000000, "Европа").
страна("Беларусь", "Минск", 9200000, "Европа").
страна("Китай", "Пекин", 1420000000, "Азия").
страна("Сингапур", "Сингапур", 5637000, "Азия").
страна("Италия", "Рим", 58940000, "Европа").
страна("Норвегия", "Осло", 5457000, "Европа").
страна("Вьетнам", "Ханой", 98190000, "Азия").

пункт_а() :-
    страна(Страна, Столица, Население, Континент),
    write(Страна), write(', '),
    write(Столица), write(', '),
    write(Население), write(', '),
    write(Континент),
    nl, fail.

пункт_б(Порог) :-
    страна(Страна, Столица, Население, Континент),
    Население >= Порог,
    write(Страна), write(', '),
    write(Столица), write(', '),
    write(Население), write(', '),
    write(Континент),
    nl, fail.

пункт_в(Порог) :-
    страна(Страна, Столица, Население, Континент),
    Население =< Порог,
    Континент == "Европа",
    write(Страна), write(', '),
    write(Столица), write(', '),
    write(Население), write(', '),
    write(Континент),
    nl, fail.