/* книга(Автор, Название, Издательство, Год_издания). */

книга("Пушкин", "Евгений онегин", "АСТ", 2018).
книга("Гоголь", "Мёртвые души", "Эксмо", 2022).
книга("Толстой", "Война и мир", "АСТ", 2017).
книга("Горький", "На дне", "Эксмо", 2007).
книга("Булгаков", "Мастер и Маргарита", "Эксмо", 2005).
книга("Грибоедов", "Горе от ума", "Эксмо", 2014).
книга("Куприн", "Яма", "МИФ", 2023).
книга("Гоголь", "Нос", "Эксмо", 2013).

пункт_а :- 
    книга(Автор, Название, Издательство, Год),
    write(Автор), write(', '),
    write(Название), write(', '),
    write(Издательство), write(', '),
    write(Год),
    nl, fail.

пункт_б :- 
    книга("Пушкин", Название, Издательство, Год),
    write("Пушкин"), write(', '),
    write(Название), write(', '),
    write(Издательство), write(', '),
    write(Год),
    nl, fail;
    книга("Гоголь", Название, Издательство, Год),
    write("Гоголь"), write(', '),
    write(Название), write(', '),
    write(Издательство), write(', '),
    write(Год),
    nl, fail.

пункт_в :-
    книга(Автор, Название, "Эксмо", Год),
    Год >= 2010,
    write(Автор), write(', '),
    write(Название), write(', '),
    write("Эксмо"), write(', '),
    write(Год),
    nl, fail.

