справочник("Сергей", "+79270039874").
справочник("Антон", "+79067345801").
справочник("Пётр", "+79019873412").
справочник("Екатерина", "+79731019080").
справочник("Мария", "+79316497808").
справочник("Василиса", "+79615419807").

информация :-
    справочник(Имя, Телефон),
    write(Имя), write(', '),
    write(Телефон), write(', '),
    nl, fail.

% как Prolog понимает, какой параметр локальный?
поиск_по_имени(Имя) :-
    справочник(Имя, Телефон),
    Имя == Имя,
    write(Имя), write(', '),
    write(Телефон), write(', '),
    nl, fail.

поиск_по_телефону(Телефон) :-
    справочник(Имя, Телефон),
    Телефон == Телефон,
    write(Имя), write(', '),
    write(Телефон), write(', '),
    nl, fail.