INSERT INTO Gyms (Title, OpenTime, CloseTime, Address)
VALUES	('Safia', '7:00:00', '22:30:00', 'ул. Кутякова 68'),
		('First Gym', '7:00:00', '23:00:00', 'ул. Гоголя 83'),
		('MetroFitness', '6:00:00', '6:00:00', 'ул. Московская 129/133'),
		('Alex Fitness', '7:00:00', '23:00:00', 'ул. Дзержинского 24'),
		('Forte Club', '7:00:00', '23:00:00', 'ул. Вольская 29'),
		('IronShape', '6:00:00', '6:00:00', 'ул. Ипподромная 47'),
		('Big Muscle', '6:00:00', '6:00:00', 'ул. Пушкина 135');

INSERT INTO Clients (LastName, FirstName, Surname, BirthDate, PhoneNumber)
VALUES	('Иванов','Сергей', 'Иванович', '1984.03.27','+7(927)723-37-66'),
		('Александров','Иван', 'Владимирович', '1987.06.02','+7(893)765-01-03'),
		('Таран','Евгений', 'Вячеславович', '1991.12.08','+7(923)830-44-45'),
		('Михайличенко','Виктор', 'Станиславович', '1993.04.05','+7(923)543-55-44'),
		('Соловьёв','Руслан', 'Викторович', '1967.11.21','+7(923)554-04-37'),
		('Полозков','Антон', 'Игоревич', '2003.02.25','+7(927)223-65-34');

INSERT INTO Lockers (ID_gym, ID_client, LockerNumber, ExpiringDate, Expired)
VALUES	(2, 1, 7, '2023.12.01', 0),
		(2, 3, 9, '2023.11.01', 1);

INSERT INTO ItemTypes (Type)
VALUES	('Беговая дорожка'),
		('Гиря'),
		('Гантеля'),
		('Блин'),
		('Тренажёр'),
		('Стойка для блинов'),
		('Кулер'),
		('Шкаф для вещей'),
		('Другое');

INSERT INTO Inventory (ItemName, ID_type, ID_gym, SerialNumber, CheckDate, NeedReplacement)
VALUES	('Блин 5кг Зелёный', 4, 1, 120001, '2021.06.01', 0),
		('Блин 5кг Зелёный', 4, 1, 120002, '2021.06.01', 0),
		('Блин 5кг Зелёный', 4, 1, 120003, '2021.06.01', 0),
		('Блин 10кг Зелёный', 4, 2, 133001, '2021.06.01', 0),
		('Блин 10кг Зелёный', 4, 2, 133002, '2021.06.01', 0),
		('Блин 10кг Зелёный', 4, 2, 133003, '2021.06.01', 0),
		('Блин 15кг Оранжевый', 4, 3, 141001, '2019.09.01', 0),
		('Блин 15кг Оранжевый', 4, 3, 141002, '2019.09.01', 0),
		('Блин 15кг Оранжевый', 4, 3, 141003, '2020.07.23', 0),
		('Беговая дорожка RunnerFirst', 1, 1, 103001, '2018.03.01', 0),
		('Беговая дорожка RunnerFirst', 1, 2, 103002, '2018.06.01', 0),
		('Беговая дорожка RunnerFirst', 1, 2, 103003, '2018.06.01', 0),
		('Беговая дорожка RunnerFirst', 1, 2, 103004, '2018.06.01', 0),
		('Беговая дорожка RunnerFirst', 1, 5, 103005, '2018.09.01', 0),
		('Беговая дорожка RunnerFirst', 1, 6, 103006, '2018.12.01', 0),
		('Кулер Кристальный', 7, 3, 181001, '2022.12.01', 0);

INSERT INTO Employees (ID_gym, Lastname, FirstName, Surname, PhoneNumber, BirthDate, Occupation)
VALUES	(1, 'Евдокимов', 'Евпатий', NULL, '+7(927)241-55-37', '1965.03.05', 'Administrator'),
		(2, 'Салтыков', 'Евгений', 'Павлович', '+7(837)244-47-13', '1985.03.05', 'Administrator'),
		(3, 'Магомедов', 'Артур', NULL, '+7(654)265-98-01', '1987.03.05', 'Administrator'),
		(4, 'Мадамова', 'Евгения', 'Сергеевна', '+7(947)345-71-09', '1977.03.05', 'Administrator'),
		(3, 'Слонова', 'Севилья', 'Игоревна', '+7(957)435-55-43', '1963.03.05', 'Cleaner'),
		(4, 'Сорокина', 'Анастасия', 'Викторовна', '+7(348)125-51-44', '2001.03.05', 'Cleaner'),
		(5, 'Лизакина', 'Елизавета', 'Станиславовна', '+7(834)522-51-37', '2000.03.05', 'Administrator'),
		(6, 'Дуров', 'Павел', 'Игоревич', '+7(933)954-61-39', '1992.03.05', 'Administrator');

INSERT INTO Tariffs (Title, Price)
VALUES	('Базовый', 1900),
		('С тренером', 2900),
		('Премиум', 3500);

INSERT INTO Groups (ID_tariff)
VALUES	(1),
		(2),
		(1),
		(1),
		(3),
		(3);

INSERT INTO Clients_Groups (ID_client, ID_group)
VALUES	(1, 2),
		(2, 1),
		(2, 5),
		(3, 5),
		(4, 5),
		(5, 1),
		(6, 1);

INSERT INTO Subscriptions (ID_client, ID_gym, ID_tariff, StartingDate, ExpiringDate, Expired)
VALUES	(1, 2, 1, '2023.09.18', '2023.12.18', 0),
		(2, 1, 2, '2023.06.02', '2023.11.02', 1),
		(3, 3, 1, '2021.11.13', '2024.02.23', 0);

INSERT INTO Activities (ActivityName)
VALUES	('Футбол'),
		('Баскетбол'),
		('Гандбол'),
		('Армрестлинг'),
		('Растяжка'),
		('Личная тренировка');

INSERT INTO Coaches (Lastname, Firstname, Surname, Rating, BirthDate)
VALUES	('Сибирцев', 'Константин', 'Вадимович', 4.1, '1983.09.13'),
		('Алеутов', 'Святогор', 'Брониславович', 3.2, '1986.12.23'),
		('Лепетин', 'Егор', 'Евгеньевич', 3.3, '1993.11.02'),
		('Галкин', 'Виталий', 'Александрович', 4.8, '1970.03.19');

INSERT INTO CoachActivities (ID_coach, ID_activity)
VALUES	(4, 3),
		(4, 5),
		(2, 4),
		(1, 6),
		(3, 6);

INSERT INTO GymActivities (ID_gym, ID_activity)
VALUES	(1, 1),
		(1, 2),
		(1, 3),
		(1, 5),
		(2, 3),
		(2, 5),
		(3, 4),
		(3, 5),
		(3, 6),
		(4, 5),
		(4, 6),
		(5, 5),
		(4, 6),
		(6, 5),
		(6, 6);

INSERT INTO Schedule (ID_gym, ID_activity, ID_coach, ID_group, StartTime, EndTime, Day)
VALUES	(1, 3, 4, 5, '17:00:00', '19:00:00', '2023.11.04'),
		(1, 3, 4, 5, '17:00:00', '19:00:00', '2023.11.11'),
		(1, 3, 4, 5, '17:00:00', '19:00:00', '2023.11.18'),
		(1, 3, 4, 5, '17:00:00', '19:00:00', '2023.11.25'),
		(2, 5, 1, 3, '12:00:00', '13:30:00', '2023.11.03'),
		(2, 5, 1, 3, '12:00:00', '13:30:00', '2023.11.10'),
		(3, 6, 2, 2, '14:00:00', '15:00:00', '2023.11.04');